const segments = [
    //rasmi
    [
        {
            "start": "0:00:02",
            "end": "0:00:13",
            "text": "رییس سازمان انرژی اتمی گفت اقدام بامداد امروز علیه مرکز غنی سازی [نطنز] نشان دهنده شکست مخالفان پیشرفت های صنعتی و سیاسی کشور"
        },
        {
            "start": "0:00:13",
            "end": "0:00:16",
            "text": "برای جلوگیری از توسعه چشمگیر صنعت هسته ای است"
        },
        {
            "start": "0:00:16",
            "end": "0:00:19",
            "text": "آقای صالحی افزود این اقدام همچنین"
        },
        {
            "start": "0:00:19",
            "end": "0:00:24",
            "text": "نشان دهنده ناکامی مخالفان مذاکرات ایران برای رفع تحریم های ظالمانه است"
        },
        {
            "start": "0:00:25",
            "end": "0:00:29",
            "text": "رییس سازمان انرژی اتمی ضمن محکوم کردن این حرکت مذبوحانه"
        },
        {
            "start": "0:00:29",
            "end": "0:00:37",
            "text": "[بر] ضرورت برخورد جامعه بین المللی و آژانس بین المللی انرژی اتمی با این تروریسم هسته ای تاکید کرد"
        },
        {
            "start": "0:00:37",
            "end": "0:00:39",
            "text": "آقای صالحی تصریح کرد ایران همچنین"
        },
        {
            "start": "0:00:39",
            "end": "0:00:45",
            "text": "حق خود را برای اقدام علیه عاملان آمران و مباشران محفوظ می [داند]"
        },
        {
            "start": "0:00:45",
            "end": "0:00:49",
            "text": "رییس سازمان انرژی اتمی تاکید کرد جمهوری اسلامی ایران همچنین"
        },
        {
            "start": "0:00:49",
            "end": "0:00:53",
            "text": "برای ناکام گذاشتن اهداف آمران این حرکت تروریستی"
        },
        {
            "start": "0:00:53",
            "end": "0:01:00",
            "text": "با جدیت گسترش فناوری هسته ای و تلاش برای رفع تحریم های ظالمانه را ادامه می دهد [بند]"
        }
    ],
    //mohavereh
    [
        {
            "start": "0:00:00",
            "end": "0:00:07",
            "text": "سلام و درود امروز جمعه سوم اردیبهشت هزار و [چهار صد] و اخبار این هفته زیست"
        },
        {
            "start": "0:00:07",
            "end": "0:00:14",
            "text": "بوم اندیشکده [یک] کشور را با چهل و نهمین پادکست خبری جامعه اندیشکده ها مرور می کنید"
        },
        {
            "start": "0:00:14",
            "end": "0:00:21",
            "text": "با موضوع انتخابات هزار و چهارصد شروع کنیم در آستانه انتخابات ریاست جمهوری پیش رو"
        },
        {
            "start": "0:00:21",
            "end": "0:00:32",
            "text": "جامعه اندیشکده ها با مشارکت اندیشکده های کشور طرحی در دست اجرا [دارید] با عنوان اندیشکده ها و نقش آفرینی در انتخابات هزار و چهارصد"
        },
        {
            "start": "0:00:32",
            "end": "0:00:39",
            "text": "این [ترتیب] سه مرحله [قرار] با شناسایی نظام مسایل کشور به سراغ نامزدهای انتخابات بره"
        },
        {
            "start": "0:00:39",
            "end": "0:01:00",
            "text": "به این صورت که ابتدا مسایل توسط اندیشکده ها و اندیشه ورزان شناسایی اولویت بندی و نهایی می [شود] و در یک کمپین عمومی و با مشارکت شهروندان و رای دهندگان درباره مسایل کشور و اولویت هایی که هر نامزد باید برای آنها برنامه ای داشته باشه نظر سنجی میشه"
        }
    ],
    //telephone
    [
        {
            "start": "0:00:00",
            "end": "0:00:02",
            "text": "گفتگوی تلفنی الان داریم و"
        },
        {
            "start": "0:00:02",
            "end": "0:00:04",
            "text": "موضوع گفتگو تلفنی [آن] هم بحث"
        },
        {
            "start": "0:00:04",
            "end": "0:00:08",
            "text": "خودرو قرار بر این بود اگر خاطر شریفتون باشه که"
        },
        {
            "start": "0:00:08",
            "end": "0:00:14",
            "text": "سوال از آقای نعمت زاده وزیر محترم صنعت معدن و تجارت در رابطه با خودرو و"
        },
        {
            "start": "0:00:14",
            "end": "0:00:19",
            "text": "نتایج کمیته تحقیق و تفحص خودرو در صحن علنی مجلس"
        },
        {
            "start": "0:00:19",
            "end": "0:00:23",
            "text": "مطرح بشه با جناب آقای علی دو رییس کمیته تهیه و تفحص از"
        },
        {
            "start": "0:00:23",
            "end": "0:00:27",
            "text": "خودرو گفتگو می کنیم آقای علی سلام صبح شما بخیر وقت بخیر هر [جایی] که هستی"
        },
        {
            "start": "0:00:28",
            "end": "0:00:31",
            "text": "سلام علیکم جناب آقای [مرزی] و"
        },
        {
            "start": "0:00:31",
            "end": "0:00:35",
            "text": "سلام و عرض ادب دارم خدمت همه"
        },
        {
            "start": "0:00:35",
            "end": "0:00:39",
            "text": "کاران شما و شنوندگان و بینندگان عزیز [و]"
        },
        {
            "start": "0:00:39",
            "end": "0:00:43",
            "text": "[سلام] من عذرخواهی می کنم یه مقدار سرما خوردم صدا [اگر]"
        },
        {
            "start": "0:00:43",
            "end": "0:00:47",
            "text": "خواهش می کنم [و علامت خواهی می کنم]"
        },
        {
            "start": "0:00:47",
            "end": "0:00:55",
            "text": "[جناب علی ایران هنوز] باکو هستید نه من ایران ما دیشب پریشب در حقیقت [مثل شب با دو بامداد]"
        },
        {
            "start": "0:00:55",
            "end": "0:00:57",
            "text": "اومدیم و در خدمت شما عزیزان هست"
        },
        {
            "start": "0:00:57",
            "end": "0:01:00",
            "text": "سلامت باشید انشالله مقدمات سفر آن"
        }
    ],
    //bamusic
    //ghadimi
    //lahje
    //englisi
]

export {segments};
