const segments = [
    [
        {
            "start": "0:00:00",
            "end": "0:00:02",
            "text": "[حکایت]"
        },
        {
            "start": "0:00:02",
            "end": "0:00:06",
            "text": "یکی را از حکما شنیدم که می گفت"
        },
        {
            "start": "0:00:06",
            "end": "0:00:11",
            "text": "هرگز کسی به جهل خویش اقرار نکرده است"
        },
        {
            "start": "0:00:11",
            "end": "0:00:16",
            "text": "مگر آن کس که چون دیگری در سخن باشد"
        },
        {
            "start": "0:00:16",
            "end": "0:00:21",
            "text": "همچنان ناتمام گفته سخن آغاز کند"
        },
        {
            "start": "0:00:21",
            "end": "0:00:26",
            "text": "سخن را سر از [ای] خردمند و بن"
        },
        {
            "start": "0:00:26",
            "end": "0:00:30",
            "text": "میا بر سخن در میان سخن"
        },
        {
            "start": "0:00:30",
            "end": "0:00:37",
            "text": "خداوند تدبیر و فرهنگ و [روش] نگوید سخن"
        },
        {
            "start": "0:00:37",
            "end": "0:00:39",
            "text": "تا نبیند خموش"
        }
    ],
]

export {segments};
