let html = "<div font-size=\"`${0.01931716082659479 * width}px`\" text=\"۶۳\" left=\"`${0.4132973944294699 * width}px`\" top=\"`${0.14660493827160495 * height}px`\" width=\"`${0.022461814914645103 * width}px`\" height=\"`${0.034722222222222224 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.025157232704402517 * width}px`\" text=\"اشباع‌مدت ۵ دقیقه جوشانده د رد اخل یک بوته چینی وزن شده صاف‌کنید\\n\" + و باقیمانده را left=\"`${0.11006289308176101 * width}px`\" top=\"`${0.2199074074074074 * height}px`\" width=\"`${0.6064690026954178 * width}px`\" height=\"`${0.046296296296296294 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.02425876010781671 * width}px`\" text=\"با ۱۰ میلی لیترآب‌گرپشوئید ومایع شستشو را به صاف شده اضافه کنید\\n\" + و به مایع صاف شده left=\"`${0.11230907457322552 * width}px`\" top=\"`${0.30092592592592593 * height}px`\" width=\"`${0.6064690026954178 * width}px`\" height=\"`${0.047839506172839504 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.023809523809523808 * width}px`\" text=\"و شستشویك میلی لیتر اسید سولفوریك R افزوده تاحد خشکی تبخیر و تا\\n\" + وزن ثابت تکلیس left=\"`${0.11230907457322552 * width}px`\" top=\"`${0.37808641975308643 * height}px`\" width=\"`${0.6064690026954178 * width}px`\" height=\"`${0.04089506172839506 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.026504941599281222 * width}px`\" text=\"کنید وزن باقیمانده نباید بیش‌از ۳۵ میلی‌گرم باشد (% ۳/۵ )\" left=\"`${0.29065588499550765 * width}px`\" top=\"`${0.4537037037037037 * height}px`\" width=\"`${0.42677448337825696 * width}px`\" height=\"`${0.0470679012345679 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.023809523809523808 * width}px`\" text=\"مواد محلول دراتانل : ۲ گرم آنرا با ۴۰ میلی ‌لیتراتانل ۹۵% R\\n\" + زیریك کندانسور رفلو left=\"`${0.11455525606469003 * width}px`\" top=\"`${0.5324074074074074 * height}px`\" width=\"`${0.5525606469002695 * width}px`\" height=\"`${0.047839506172839504 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.025157232704402517 * width}px`\" text=\"مدت پنج دقیقه بجوشانید وصاف کنید، ۲۰ میلی لیتر ازصاف شده را روی\\n\" + حمام آبجوش left=\"`${0.11904761904761904 * width}px`\" top=\"`${0.6087962962962963 * height}px`\" width=\"`${0.5974842767295597 * width}px`\" height=\"`${0.046296296296296294 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.024707996406109614 * width}px`\" text=\"تاحد خشکی تبخیر ود رحرارت ۱۰۰ درجه مدت یکساعت بخشکانید و\\n\" + وزن‌باقیماند، بیش‌از left=\"`${0.11006289308176101 * width}px`\" top=\"`${0.6867283950617284 * height}px`\" width=\"`${0.6064690026954178 * width}px`\" height=\"`${0.04243827160493827 * height}px`\"></div>\n" +
    "<div font-size=\"`${0.023809523809523808 * width}px`\" text=\" ۲ میلی‌گرم نیست ( ۰/۲۶).\" left=\"`${0.5300988319856245 * width}px`\" top=\"`${0.7654320987654321 * height}px`\" width=\"`${0.18418688230008984 * width}px`\" height=\"`${0.04861111111111111 * height}px`\"></div>\n"

let newHtml = html
    .replaceAll("div ","div \n")
    .replaceAll("\"`","{`")
    .replaceAll("`\"","`}\n")
    .replaceAll("div","TextGroup")
    .replaceAll("font-size","fontSize")
    .replaceAll("class","className")
    .replaceAll("</TextGroup>","")
    .replaceAll(">","/>")
    .replaceAll("\" ","\"\n")
    .replaceAll("\"/","\"\n/")

console.log(newHtml)
