const keywords = {
    header: [
        'هوش مصنوعی',
        'یادگیری ماشین',
        'ocr فارسی',
        'پردازش متن و تصویر',
        'تشخیص محتوا',
    ],
    kashf: [
        'پردازش تصویر',
        'کشف محتوا',
        'یادگیری ماشین',
    ],
    alefba: [
        'تصویر به نوشته',
        'ocr فارسی',
        'ocr',
        'تصویر اسناد',
        'ساختار اسناد',
    ],
    harf: [
        'گفتار به متن',
    ],
    hazm: [
        'تحلیل متن فارسی',
        'تقطیع جمله ها',
        'تحلیل صرفی'
    ],
}

export default keywords;
